Revit 2026 API

# ElementCanDeleteSubelement Method

---

Checks if given subelement can be removed from the element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CanDeleteSubelement(
	Subelement subelem
)
```
```vb
Public Function CanDeleteSubelement (
	subelem As Subelement
) As Boolean
```
```cpp
public:
bool CanDeleteSubelement(
	Subelement^ subelem
)
```
```fsharp
member CanDeleteSubelement :
        subelem : Subelement -> bool
```

#### Parameters

subelem Subelement
     Subelement to check.

#### Return Value

Boolean True if subelement can be removed, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

Element Class

Autodesk.Revit.DB Namespace